Revit 2027 API
Water.WaterColorByObject Property
 The property labeled "Custom Color" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaterColorByObject { get; }
Public Shared ReadOnly Property WaterColorByObject As String
	Get
public:
static property String^ WaterColorByObject {
	String^ get ();
}
static member WaterColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Water Class
Autodesk.Revit.DB.Visual Namespace